cask_args appdir: "/Applications"
tap "bibendi/dip"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "wpengine/wpe-cli"
brew "autoconf"
brew "autojump"
brew "automake"
brew "cmake"
brew "coreutils"
brew "gcc"
brew "geckodriver"
brew "git"
brew "openssl@1.1"
brew "readline"
brew "python@3.8"
brew "glib"
brew "unbound"
brew "gnutls"
brew "libksba"
brew "gnupg"
brew "libtool"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "libyaml"
brew "memcached"
brew "mercurial"
brew "mysql", restart_service: true
brew "mysql-client"
brew "mysql@5.6", link: true
brew "mysql@5.7"
brew "nvm"
brew "pidof"
brew "pipenv"
brew "pkg-config"
brew "postgresql"
brew "pyenv"
brew "shellcheck"
brew "sphinx"
brew "thefuck"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-autojump"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-docker-completion"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "bibendi/dip/dip"
brew "wpengine/wpe-cli/wpe-cli"
cask "appcleaner"
cask "balsamiq-mockups"
cask "font-fira-code"
cask "iterm2"
cask "mamp"
cask "omnigraffle"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "zoom"
