adobe.xd
atlassian.atlascode
bmalehorn.shell-syntax
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
deque-systems.vscode-axe-linter
eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
GitHub.codespaces
GitHub.copilot
GitHub.copilot-chat
github.vscode-github-actions
GitHub.vscode-pull-request-github
HTMLHint.vscode-htmlhint
jmfirth.vsc-space-block-jumper
L13RARY.l13-diff
letrieu.expand-region
mikestead.dotenv
moshfeu.diff-merge
ms-playwright.playwright
ms-vscode.vs-keybindings
pranaygp.vscode-css-peek
redhat.vscode-yaml
richie5um2.vscode-sort-json
ritwickdey.LiveServer
ryu1kn.partial-diff
steoates.autoimport
stkb.rewrap
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
timonwong.shellcheck
tomoki1207.pdf
Tyriar.sort-lines
yzhang.markdown-all-in-one
