cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "act"
brew "adns"
brew "autoconf"
brew "autojump"
brew "automake"
brew "azure-cli"
# brew "cmake"
brew "curl-openssl"
brew "coreutils"
brew "freetype"
# brew "gcc"
brew "geckodriver"
brew "git"
brew "git-lfs"
brew "glib"
brew "gnupg"
brew "gnutls"
brew "helm"
brew "htop"
brew "icu4c"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "krb5"
brew "kubectl"
brew "libgcrypt"
brew "libksba"
brew "libpq"
brew "libtool"
brew "libyaml"
brew "memcached"
# brew "microsoft/vscodespaces/codespaces"
brew "mysql", restart_service: true
brew "mysql-client"
brew "mysql@5.6", link: true
brew "mysql@5.7"
brew "openssl@1.1"
brew "pgloader"
brew "pidof"
brew "pyenv"
brew "pipenv"
brew "pkg-config"
brew "postgresql"
brew "protobuf"
brew "pyenv"
brew "python"
brew "readline"
brew "redis"
brew "shellcheck"
brew "sphinx"
brew "thefuck"
brew "unbound"
brew "webp"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zlib"
brew "zsh"
cask "1password"
cask "adobe-creative-cloud"
cask "adoptopenjdk"
cask "alfred"
cask "appcleaner"
cask "appzapper"
cask "balsamiq-mockups"
cask "chiaki"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "expressvpn"
cask "firefox"
cask "font-fira-code"
cask "gemini"
cask "github"
cask "google-chrome"
cask "google-backup-and-sync"
cask "iterm2"
cask "katalon-studio"
# cask "local"
cask "mamp"
cask "messenger"
cask "microsoft-office"
cask "microsoft-teams"
# cask "mysqlworkbench"
cask "ngrok"
cask "omnigraffle"
cask "paragon-ntfs"
cask "postman"
cask "slack"
cask "spotify"
cask "teamviewer"
cask "the-unarchiver"
cask "vagrant-manager"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
