cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "adns"
brew "autoconf"
brew "autojump"
brew "automake"
brew "cmake"
brew "coreutils"
brew "gcc"
brew "geckodriver"
brew "git"
brew "microsoft/vscodespaces/codespaces"
brew "readline"
brew "python"
brew "glib"
brew "unbound"
brew "gnutls"
brew "libksba"
brew "gnupg"
brew "libtool"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "libyaml"
brew "memcached"
brew "mysql", restart_service: true
brew "mysql-client"
brew "mysql@5.6", link: true
brew "mysql@5.7"
brew "nvm"
brew "pidof"
brew "pipenv"
brew "pkg-config"
brew "postgresql"
brew "pgloader"
brew "pyenv"
brew "shellcheck"
brew "sphinx"
brew "thefuck"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zlib"
brew "zsh"
cask "adoptopenjdk"
cask "appcleaner"
cask "appzapper"
cask "balsamiq-mockups"
cask "cyberduck"
cask "docker"
cask "font-fira-code"
cask "iterm2"
cask "mamp"
cask "ngrok"
cask "omnigraffle"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"
