cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "act" # Allows for testing Github Actions on your local machine
brew "adns" # Dependencies for compiled libraries
brew "autoconf" # Dependencies for compiled libraries
brew "autojump" # A faster way to navigate your filesystem.
brew "automake" # Dependencies for compiled libraries
brew "azure-cli" # Used with internal
# brew "cmake"
brew "curl-openssl" # Used for command line curls with SSL
brew "coreutils" # Basic tools for the GNU OS
brew "direnv" # Allows the setting and getting of dotenv vars within a directory
brew "freetype" # CL Library to render fonts
# brew "gcc"
brew "geckodriver" # Used for automated browser testing
brew "git" # Core version control
brew "git-lfs" # Core version control for large files
brew "glib" # Core application library for C
brew "gnupg" # Security Dependency GNU Pretty Good Privacy (PGP) package
brew "go-jira" # Jira CLI for managing jira issues, versions, etc.
brew "gnutls" # Security Dependency GNU Transport Layer Security (TLS) Library
brew "helm" # Package manager for Kubernetes
brew "htop" # Utility for viewing command line run processes and logs
brew "icu4c" # Compiled Library Dependency for unicode and globalization
brew "imagemagick", link: false # Image manipulation utility for web applications (Legacy)
brew "imagemagick@6", link: true # Image manipulation utility for web applications
brew "krb5" # Network authentication protocol
brew "kubectl" # DevOps dependency for running kubernetes locally.
brew "libgcrypt" # Cryptographic library based on the code from GnuPG
brew "libksba" # Compiled Library Dependency X.509 and CMS library
brew "libpq" # Database Dependency for Postgres
brew "libtool" # Generic Library Support
brew "libyaml" # Compiled Dependency for web applications with Ruby on Rails
brew "memcached" # Performance Caching library for Ruby on Rails
# brew "microsoft/vscodespaces/codespaces"
brew "mysql", restart_service: true # Database Dependency for MySQL (Usually used by non-containerized web applications)
brew "mysql-client" # Database Dependency for MySQL
brew "mysql@5.6", link: true # Database Utility for older version of MySQL
brew "mysql@5.7" # Database Utility for newer version of MySQL
brew "openssl@1.1" # Network Utility for SSL requests
brew "pgloader" # Database Utility for converting MySQL databases to Postgres M1-INCOMPATIBLE
brew "pidof" # CL Dependency for displaying PID for a running process
brew "pipenv" # Python dependency management tool
brew "pkg-config" # Library Dependency for managing compile libraries
brew "postgresql" # Database System for Postgres
brew "protobuf" # Network Dependency for traffic buffering
brew "pyenv" # Python version management
brew "redis" # Primary Caching Dependency for Back-end Software Engineers
brew "shellcheck" # Recommended Command Line Linter and auto-fixing
brew "sphinx" # Application Dependency for search functionality in Ruby on Rails (Legacy)
brew "thefuck" # Recommended Command Line correction tool for mistyped commands
brew "unbound" # Network Dependency for Validating, recursive, DNS resolving
brew "webp" # Image Dependency - Image format support for .webp
brew "wget" # General Request Utility for Command Line
brew "yamllint" # Recommended Linting and auto-fixing tool for yaml
brew "yarn" # Front-end team approved package manager
brew "zlib" # Image Dependency data compression library
brew "zsh" # Default Mac OSX shell
cask "1password" # Department licensed and approved password manager
cask "adobe-creative-cloud" # Department licensed and approved UXD Tools
cask "adoptopenjdk"
cask "alfred" # Recommended task launcher application for Mac OSX
cask "appcleaner" # Recommended utility application for removing Mac OSX programs and apps
cask "chiaki"
cask "cyberduck" # Recommended GUI for FTP/SFTP transfers
cask "docker" # Department approved containerized environment tools
cask "dropbox" # Department approved cloud storage for UXD and Design
cask "expressvpn" # Department approved VPN for testing geo location
cask "firefox" # Front-end team approved browser for our viewing our applications
cask "font-fira-code" # Recommended command line icon fonts
cask "gemini" # Recommended duplicate remover
cask "github" # Department approved version control platform
cask "google-chrome" # Department approved primary browser
cask "google-backup-and-sync" # Recommended backup utility for use with google drive
cask "iterm2" # Front-end team approved command line tool for Mac OSX
cask "katalon-studio" # Front-end approved browser automation GUI/tool
cask "local" # Front-end team approved containerized environment tool for wordpress products
cask "mamp" # Front-end team approved server environment tool for wordpress and general web development
cask "messenger" # Recommended personal messenger platform
cask "microsoft-office" # Department approved productivity suite
cask "microsoft-teams" # Department approved communication tool
# cask "mysqlworkbench" # Front-end team approved database GUI/tool
cask "ngrok" # Web development testing an emulation
cask "paragon-ntfs" # Recommended utility for managing NTFS windows based drives
cask "postman" # Department approved API testing GUI/tool
cask "slack" # Department approved communication tool for specific vendors like sourcepoint
cask "spotify" # Recommended Music Service
cask "the-unarchiver" # Recommended TAR/ZIP file compression tool
cask "vagrant-manager" # Department approved virtual machine GUI/tool
cask "visual-studio-code" # Digital Technology approved IDE for software engineering
cask "vlc" # Recommended video format conversion utility
cask "zoom" # Department approved video chat and calls utility
