cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
brew 'direnv' # REQUIRED - BASE/ROR/NODE/
brew 'dotenv-linter' # REQUIRED - BASE/ROR/NODE/
brew 'freetype' # REQUIRED - BASE/ROR/NODE CL
brew 'gh' # REQUIRED - BASE/ROR/NODE/DEVOPS Github CLI
brew 'git' # REQUIRED - ROR/NODE/DEVOPS/PYTHON Core version control
brew 'icu4c' # REQUIRED - BASE/ROR/NODE/DEVOPS/PYTHON Compiled Library Dependency for unicode and globalization
brew 'gnupg' # REQUIRED - Needed for signing your commits with github.
brew "nvm" # REQUIRED - BASE/ROR/NODE/DEVOPS/PYTHON Version manager for node
brew "openssl@1.1" # REQUIRED - ROR/NODE/DEVOPS/PYTHON/PG Network Utility for SSL requests
# brew "pandoc" # OPTIONAL - ROR/NODE/DEVOPS/PYTHON/PG Allows for markdown to easily be exported into other formats like word, pdfs, and html
# brew "pipenv" # OPTIONAL - PYTHON Python dependency management tool
# brew "pyenv" # OPTIONAL - PYTHON Python version management
brew "pinentry-mac" # REQUIRED - The other dependency used for signed commits on mac.
brew "postgresql" # REQUIRED - BASE/ROR/NODE/DEVOPS Database System for Postgres
# brew "redis" # RECOMMENDED - BASE/ROR/NODE/DEVOPS/PYTHON Primary Caching Dependency for Back-end Software Engineers
brew "shellcheck" # REQUIRED - BASE/ROR/NODE/DEVOPS/PYTHON Recommended Command Line Linter and auto-fixing
brew "starship" # RECOMMENDED - BASE/ROR/NODE/DEVOPS/PYTHON Recommended platform agnostic shell prompt.
brew "thefuck" # RECOMMENDED - BASE/DEVOPS/ROR/NODE/PYTHON Recommended Command Line correction tool for mistyped commands
brew "wget" # REQUIRED - BASE/DEVOPS/ROR/NODE/PYTHON General Request Utility for Command Line
brew "yamllint" # REQUIRED - BASE/DEVOPS/ROR/NODE/PYTHON Recommended Linting and auto-fixing tool for yaml
# brew "yarn" # REQUIRED - BASE/DEVOPS/ROR/NODE Front-end team approved package manager
brew "zsh" || true # REQUIRED - BASE/DEVOPS/ROR/NODE/ Default Mac OSX shell
cask "1password" || true # REQUIRED - Department licensed and approved password manager
cask "adobe-creative-cloud" || true # RECOMMENDED - Department licensed and approved
# UXD Tools - This is installed via DevOps provisioning.
cask "alfred" # REQUIRED - task launcher application for Mac OSX
cask "appcleaner" # REQUIRED - utility application for removing Mac OSX programs and apps
# cask "cyberduck" # RECOMMENDED - BASE/ROR/NODE/DEVOPS GUI for FTP/SFTP
# transfers
# cask "browserstacklocal" # OPTIONAL - Used for local testing of browsers
cask "dbeaver-community" # OPTIONAL - BASE/ROR/NODE/DEVOPS
cask "disk-drill" # RECOMMENDED - Duplicate file finder and storage visualizer.
cask "docker" # REQUIRED - Department approved containerized environment tools
cask "dropbox" # OPTIONAL - Department approved cloud storage for UXD and Design

cask "expressvpn" # REQUIRED - Department approved VPN for testing geo location
# cask "firefox" || true # REQUIRED - Front-end team approved browser for our viewing our applications
# NOTE: These come preinstalled, uncheck if you have done a factory reset.
cask "figma" # RECOMMENDED - As an alternative to illustrator and sketch.
cask "font-fira-code" # RECOMMENDED -  command line icon fonts
cask "font-fira-code-nerd-font" # RECOMMENDED - command line icon fonts for viewing icons in Starship, agnoster, P10k, or iterm.
cask "gemini" # RECOMMENDED - Duplicate remover
cask "gpg-suite" # REQUIRED - Allows for setting up signed commits with github.
# cask "google-chrome" # REQUIRED -  Department approved primary browser
# NOTE: These come preinstalled, uncheck if you have done a factory reset.
cask "google-drive" # OPTIONAL - Recommended backup utility for use with google drive
cask "iterm2" # REQUIRED - Front-end team approved command line tool for Mac OSX
cask "inkscape" # RECOMMENDED - Front-end team approved vector graphics editor
cask "microsoft-office" || true # REQUIRED - Department approved productivity suite
cask "microsoft-edge" # REQUIRED - Corporate approved browser for using CoPilot.
cask "microsoft-teams" || true # REQUIRED - Department approved communication tool
cask "mysqlworkbench" # REQUIRED - Front-end team approved database GUI/tool
cask 'postman' # REQUIRED - Department approved API testing GUI/tool
# cask 'the-unarchiver' # RECOMMENDED - TAR/ZIP file compression tool
# cask 'vincelwt-chatgpt' # RECOMMENDED - AI Chat service
cask 'visual-studio-code' || true # REQUIRED -  Digital Technology approved IDE for software engineering
# cask "katalon-studio" # RECOMMENDED -  Front-end approved browser automation GUI/tool
# cask "mamp" # RECOMMENDED - Front-end team approved server environment tool for wordpress and general web development
cask "messenger" # RECOMMENDED - personal messenger platform
# cask 'slack' # OPTIONAL - Department approved communication tool for specific vendors like sourcepoint
cask 'spotify' # RECOMMENDED - Music Service
cask 'vlc' # RECOMMENDED - Video format conversion utility
cask 'zoom' # RECOMMENDED - Department approved video chat and calls utility
cask '1password-cli' # RECOMMENDED - Useful for integrating with alfred and vaults.
